# Завдання 1
# Створіть масив:
# 1 2 3 4
# 5 6 7 8
# 9 10 11 12
# 13 14 15 16
# Використовуючи індекси виведіть:
# ● число 14
# ● третій рядок
# ● перший стовпчик
# ● верхню половину
# ● замініть числа в рядках 2-3 на 100
# ● зробіть другий рядок таким як останній рядок



import numpy as np

arr = np.array([[1, 2, 3, 4],
                [5, 6, 7, 8],
                [9, 10, 11, 12],
                [13, 14, 15, 16]])

print("Початковий масив:")
print(arr)

# ● число 14
print(" Число 14:", arr[3, 1])

# ● третій рядок
print("Третій рядок:", arr[2])

# ● перший стовпчик

print("Перший стовпчик:", arr[:, 0])

# ● верхню половину

print("Верхня половина:")
print(arr[:2])


# ● замініть числа в рядках 2-3 на 100

arr_modified = arr.copy()
arr_modified[1:3] = 100
print(arr_modified)
print()

# ● зробіть другий рядок таким як останній рядок
arr_modified2 = arr.copy()
arr_modified2[1] = arr_modified2[-1]
print(arr_modified2)




# Завдання 2
# У масиві з попереднього завдання створіть маску для
# парних чисел. З її допомогою
# ● виведіть самі числа
# ● замініть їх на 100



mask = arr % 2 == 0
print("Маска  парних чисел:")
print(mask)
print()

# ● виведіть самі парні числа

even_numbers = arr[mask]
print(" Парні:", even_numbers)


# ● замініть їх на 100
arr_with_replaced_evens = arr.copy()
arr_with_replaced_evens[mask] = 100
print(arr_with_replaced_evens)



# Завдання 3
# Створіть 2 масиви типу uint8:
# Масив 1: 128 200 10
# Масив 2: 250 10 34
# Об’єднайте їх у пропорції 20% першого масив + 80%
# другого масиву. В результаті має бути тип даних uint8 та
# числа в діапазоні 0-255



arr1 = np.array([128, 200, 10], dtype=np.uint8)
arr2 = np.array([250, 10, 34], dtype=np.uint8)

print("Масив 1:", arr1)
print("Масив 2:", arr2)

result = 0.2 * arr1 + 0.2 * arr2
result = result.astype(np.uint8)

print("<UNK> 1:", result)